
<h2>最新消息</h2>


<h2>無線網路Wifi帳號密碼(2019下半年)<br>
SSID：CSIE_guest<br>
帳號：guest_H7C8B<br>
密碼：IM6DMBRR</h2>

<h2>2019/08/04</h2>
<ul>
	<li>期末考試改到219教室</li>
	<li>期末考試(六選一題)已上傳至<a href="/Course/Cpp/Download/">Download區</a>，完成後在下周日(8/11)前寄至lkm543@gmail.com</li>
	<li>作業繳交截止日期也在8/11(日)</li>
	<li>麻煩填個教學問券:<a href="https://forms.gle/9qAQAWcviqf8mmmf7">https://forms.gle/9qAQAWcviqf8mmmf7</a></li>
	<ul>
		<li>本期開課日:2019/07/06</li>
		<li>學號:CB318XXX</li>
		<li>講師姓名:李耕銘</li>
		<li>教室號碼:223B</li>
	</ul>
</ul>

<h2>2019/08/03</h2>
<ul>
	<li>本日08/03(六)因高壓電施工停課乙次</li>
	<li>08/04(日) 09:00-12:00正常上課</li>
	<li>期末考改期至08/04(日) 19:00-22:00，若不克前來，題目公告於Download區可自行撰寫</li>
</ul>

<h2>2019/07/07</h2>
<ul>
	<li>期末考試(六選一題)預計今日晚間批改完</li>
</ul>

<h2>2019/04/13</h2>
<ul>
	<li>期末考試(六選一題)已上傳至<a href="/Course/Cpp/Download/">Download區</a>，完成後請寄至lkm543@hotmail.com</li>
	<li>4/14早上的期末考試，改至4/14(日)的19:00-22:00於108教室舉行</li>
	<li>4/14(日)晚上若不克前來，題目公告於Download區可自行撰寫</li>
	<li>4/6、7清明連假停課一周</li>
	<li>作業參考答案已上傳</li>
</ul>

<h2>2019/01/01</h2>
<ul>
	<li>更新上傳Chapter 14 15的PPT</li>
</ul>

<h2>2017/12/03</h2>
<ul>
	<li>因效益不高且影響網頁瀏覽體驗，移除網頁挖礦</li>
</ul>

<h2>2017/12/01</h2>
<ul>
	<li>影片修改為Youtube連結，增加瀏覽速度，預計12月底~1月中影片更新完畢</li>
</ul>

<h2>2017/10/31</h2>
<ul>
	<li>網站更新，使用Easy Tabs提升瀏覽速度</li>
</ul>
<h2>2017/10/26</h2>
<ul>
	<li>影片新增中，跟Udemy用同版影片，因此編排順序上可能有一點差異</li>
</ul>
<h2>2017/10/13</h2>
<ul>
	<li>PPT模板與內容更新，緩慢更新中，預計一個半月更新完畢</li>
</ul>
<h2>2017/05/18</h2>
<ul>
	<li>新增作業上傳區/後台，以後作業可以直接在此處上傳</li>
</ul>
<h2>2017/05/14</h2>
<ul>
	<li>期末考題目/作業解答/參考資料改放置在網站上的Download區</li>
</ul>
<h2>2017/03/25</h2>
<ul>
	<li>因Dropbox連結失效，更改連結為本地端</li>
	<li>更新部分在備忘稿中的bug</li>
</ul>
<h2>2017/02/07</h2>
<ul>
	<li>HW1~4更新完畢</li>
	<li>更新Resources內容</li>
	<li>更新每一章節的簡介</li>
</ul>
<h2>2016/11/12</h2>
<ul>
	<li>密碼建置完畢，CPP////ILOVECPP</li>
	<li>新增Resources內容</li>
	<li>新增HW1~4</li>
</ul>
<h2>2016/11/01</h2>
<ul>
	<li>系統與網站大綱建置完畢，上課PPT下載連結已連上</li>
	<li>上課PPT的章節有調整過，所以跟舊版不同，但內容是一致的</li>
	<li>課程內容目前尚未開工，影音檔線上播放仍有問題</li>
	<li>目前暫時不需密碼登入，之後會以固定的帳號密碼將其鎖起來</li>
	<li>由於下兩周遇到學校期中考，所以更新進度可能會慢一些</li>
</ul>